#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_alb_target_group.main will be created
  + resource "aws_alb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "techchallangeapp-tg"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techchallangeapp"
          + "Name"        = "techchallangeapp-alb-target-group"
        }
      + tags_all                           = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techchallangeapp"
          + "Name"        = "techchallangeapp-alb-target-group"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/healthcheck"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 25
          + unhealthy_threshold = 5
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_appautoscaling_policy.ecs_down will be created
  + resource "aws_appautoscaling_policy" "ecs_down" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "scale_down-techchallangeapp"
      + policy_type        = "StepScaling"
      + resource_id        = "service/Playground-cluster/techchallangeapp"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Maximum"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = -1
            }
        }
    }

  # aws_appautoscaling_policy.ecs_up will be created
  + resource "aws_appautoscaling_policy" "ecs_up" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "scale_up-techchallangeapp"
      + policy_type        = "StepScaling"
      + resource_id        = "service/Playground-cluster/techchallangeapp"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Maximum"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = 1
            }
        }
    }

  # aws_appautoscaling_target.ecs_target will be created
  + resource "aws_appautoscaling_target" "ecs_target" {
      + id                 = (known after apply)
      + max_capacity       = 1
      + min_capacity       = 1
      + resource_id        = "service/Playground-cluster/techchallangeapp"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # aws_cloudwatch_log_group.log_group will be created
  + resource "aws_cloudwatch_log_group" "log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "techchallangeapp"
      + retention_in_days = 30
      + tags              = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techchallangeapp"
          + "Name"        = "techchallangeapp-cloudwatch-log-group"
        }
      + tags_all          = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techchallangeapp"
          + "Name"        = "techchallangeapp-cloudwatch-log-group"
        }
    }

  # aws_cloudwatch_metric_alarm.service_cpu_high will be created
  + resource "aws_cloudwatch_metric_alarm" "service_cpu_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "cpu_utilization_high-techchallangeapp"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "ClusterName" = "Playground-cluster"
          + "ServiceName" = "techchallangeapp"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 85
      + treat_missing_data                    = "missing"
    }

  # aws_db_instance.rds will be created
  + resource "aws_db_instance" "rds" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + allow_major_version_upgrade           = false
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = false
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = "main"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "9.6"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "techchallangeapp"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.micro"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = true
      + name                                  = "techchallangeapp"
      + nchar_character_set_name              = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "techchallangeapp-rds-pg"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_type                          = "gp2"
      + tags                                  = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techchallangeapp"
          + "Name"        = "techchallangeapp-rds"
        }
      + tags_all                              = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techchallangeapp"
          + "Name"        = "techchallangeapp-rds"
        }
      + timezone                              = (known after apply)
      + username                              = (sensitive)
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_parameter_group.default will be created
  + resource "aws_db_parameter_group" "default" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + family      = "postgres9.6"
      + id          = (known after apply)
      + name        = "techchallangeapp-rds-pg"
      + name_prefix = (known after apply)
      + tags        = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techchallangeapp"
          + "Name"        = "techchallangeapp-parameter-group"
        }
      + tags_all    = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techchallangeapp"
          + "Name"        = "techchallangeapp-parameter-group"
        }

      + parameter {
          + apply_method = "immediate"
          + name         = "work_mem"
          + value        = "1048576"
        }
    }

  # aws_db_subnet_group.default will be created
  + resource "aws_db_subnet_group" "default" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "main"
      + name_prefix = (known after apply)
      + subnet_ids  = (known after apply)
      + tags        = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "db_subnet_group"
        }
      + tags_all    = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "db_subnet_group"
        }
    }

  # aws_ecs_cluster.cluster will be created
  + resource "aws_ecs_cluster" "cluster" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "Playground-cluster"
      + tags_all           = (known after apply)

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # aws_ecs_service.service will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "techchallangeapp"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "techchallangeapp"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.task will be created
  + resource "aws_ecs_task_definition" "task" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "techchallangeapp"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "GitRepoName" = "application-terraform"
          + "Group"       = "techchallangeapp"
          + "Name"        = "techchallangeapp-task"
        }
      + tags_all                 = {
          + "GitRepoName" = "application-terraform"
          + "Group"       = "techchallangeapp"
          + "Name"        = "techchallangeapp-task"
        }
    }

  # aws_eip.nat will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "nat_gateway_eip"
        }
      + tags_all             = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "nat_gateway_eip"
        }
      + vpc                  = true
    }

  # aws_iam_policy.ecs_autoscale_role_policy will be created
  + resource "aws_iam_policy" "ecs_autoscale_role_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "ecs-autoscale-role-policy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecs:UpdateService",
                          + "ecs:DescribeServices",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "cloudwatch:DescribeAlarms"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_policy.ecs_execution_role_policy will be created
  + resource "aws_iam_policy" "ecs_execution_role_policy" {
      + arn         = (known after apply)
      + description = "allow service to access ecr and create logs"
      + id          = (known after apply)
      + name        = "ecs-execution-role-policy"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.ecs_autoscale_role will be created
  + resource "aws_iam_role" "ecs_autoscale_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "application-autoscaling.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-autoscale-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "ecs-autoscale-role"
        }
      + tags_all              = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "ecs-autoscale-role"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.ecs_execution_role will be created
  + resource "aws_iam_role" "ecs_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-task-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techchallangeapp"
          + "Name"        = "ecs-execution-role"
        }
      + tags_all              = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techchallangeapp"
          + "Name"        = "ecs-execution-role"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.ecs_autoscale_role_attachement will be created
  + resource "aws_iam_role_policy_attachment" "ecs_autoscale_role_attachement" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ecs-autoscale-role"
    }

  # aws_iam_role_policy_attachment.ecs_execution_role_attachement will be created
  + resource "aws_iam_role_policy_attachment" "ecs_execution_role_attachement" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ecs-task-execution-role"
    }

  # aws_internet_gateway.internet_gw will be created
  + resource "aws_internet_gateway" "internet_gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "internet_gateway"
        }
      + tags_all = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "internet_gateway"
        }
      + vpc_id   = (known after apply)
    }

  # aws_lb.app_alb will be created
  + resource "aws_lb" "app_alb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = true
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "application-loadbalancer"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "application-loadbalancer"
        }
      + tags_all                   = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "application-loadbalancer"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.techchallange will be created
  + resource "aws_lb_listener" "techchallange" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "404 - Not found"
              + status_code  = "404"
            }
        }
    }

  # aws_lb_listener_rule.techchallange_rule will be created
  + resource "aws_lb_listener_rule" "techchallange_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {

          + path_pattern {
              + values = [
                  + "/*",
                ]
            }
        }
    }

  # aws_nat_gateway.nat_gw will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "nat_gateway"
        }
      + tags_all             = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "nat_gateway"
        }
    }

  # aws_route.internet will be created
  + resource "aws_route" "internet" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.nat will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.app-private will be created
  + resource "aws_route_table" "app-private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "app-route-table"
        }
      + tags_all         = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "app-route-table"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.db-private will be created
  + resource "aws_route_table" "db-private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "db-route-table"
        }
      + tags_all         = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "db-route-table"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "public-route-table"
        }
      + tags_all         = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "public-route-table"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.db-private[0] will be created
  + resource "aws_route_table_association" "db-private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.db-private[1] will be created
  + resource "aws_route_table_association" "db-private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.db-private[2] will be created
  + resource "aws_route_table_association" "db-private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.app_alb will be created
  + resource "aws_security_group" "app_alb" {
      + arn                    = (known after apply)
      + description            = "inbound and outbound traffic for application"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outgoing traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all incoming HTTP traffic"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "application-loadbalancer-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "application-loadbalancer-sg"
        }
      + tags_all               = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "application-loadbalancer-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.rds will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "inbound and outbound traffic for rds"
      + egress                 = [
          + {
              + cidr_blocks      = []
              + description      = "Allow all outgoing Postgres traffic to ECS"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 5432
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow all incoming Postgres traffic from ECS"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = "techchallangeapp-rds-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techchallangeapp"
          + "Name"        = "rds-sg"
        }
      + tags_all               = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techchallangeapp"
          + "Name"        = "rds-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.service_sg will be created
  + resource "aws_security_group" "service_sg" {
      + arn                    = (known after apply)
      + description            = "inbound and outbound traffic for application"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outgoing traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.4.0/24",
                  + "10.0.5.0/24",
                  + "10.0.6.0/24",
                ]
              + description      = "Allow all incoming HTTP traffic from the app subnet and the ALB"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "techchallangeapp-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techchallangeapp"
          + "Name"        = "techchallangeapp-sg"
        }
      + tags_all               = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techchallangeapp"
          + "Name"        = "techchallangeapp-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_ssm_parameter.rds_password will be created
  + resource "aws_ssm_parameter" "rds_password" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "/rds/techchallangeapp/password"
      + overwrite = true
      + tags      = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techchallangeapp"
          + "Name"        = "techchallangeapp db name"
        }
      + tags_all  = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techchallangeapp"
          + "Name"        = "techchallangeapp db name"
        }
      + tier      = "Standard"
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # aws_ssm_parameter.rds_username will be created
  + resource "aws_ssm_parameter" "rds_username" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "/rds/techchallangeapp/username"
      + overwrite = true
      + tags      = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techchallangeapp"
          + "Name"        = "techchallangeapp db user name"
        }
      + tags_all  = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techchallangeapp"
          + "Name"        = "techchallangeapp db user name"
        }
      + tier      = "Standard"
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # aws_subnet.app_subnet[0] will be created
  + resource "aws_subnet" "app_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "app-ap-southeast-2a"
        }
      + tags_all                                       = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "app-ap-southeast-2a"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.app_subnet[1] will be created
  + resource "aws_subnet" "app_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "app-ap-southeast-2b"
        }
      + tags_all                                       = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "app-ap-southeast-2b"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.app_subnet[2] will be created
  + resource "aws_subnet" "app_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "app-ap-southeast-2c"
        }
      + tags_all                                       = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "app-ap-southeast-2c"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.db_subnet[0] will be created
  + resource "aws_subnet" "db_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.7.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "db-ap-southeast-2a"
        }
      + tags_all                                       = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "db-ap-southeast-2a"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.db_subnet[1] will be created
  + resource "aws_subnet" "db_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.8.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "db-ap-southeast-2b"
        }
      + tags_all                                       = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "db-ap-southeast-2b"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.db_subnet[2] will be created
  + resource "aws_subnet" "db_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.9.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "db-ap-southeast-2c"
        }
      + tags_all                                       = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "db-ap-southeast-2c"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "public-ap-southeast-2a"
        }
      + tags_all                                       = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "public-ap-southeast-2a"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "public-ap-southeast-2b"
        }
      + tags_all                                       = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "public-ap-southeast-2b"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "public-ap-southeast-2c"
        }
      + tags_all                                       = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techallangeapp"
          + "Name"        = "public-ap-southeast-2c"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techchallange"
          + "Name"        = "techchallangevpc"
        }
      + tags_all                             = {
          + "GitRepoName" = "TechChallengeApp_Infrastructure"
          + "Group"       = "techchallange"
          + "Name"        = "techchallangevpc"
        }
    }

  # random_password.password will be created
  + resource "random_password" "password" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_string.username will be created
  + resource "random_string" "username" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

Plan: 55 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: out.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "out.plan"

```

</details>

*Pusher: @aruna-cande, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*